<a href="https://colab.research.google.com/github/TunaInABottle/data_mining_2022/blob/main/Collaborative_Filtering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/TunaInABottle/data_mining_2022.git

Cloning into 'data_mining_2022'...
remote: Enumerating objects: 111, done.
remote: Counting objects: 100% (111/111), done.
remote: Compressing objects: 100% (80/80), done.
remote: Total 111 (delta 45), reused 82 (delta 25), pack-reused 0
Receiving objects: 100% (111/111), 53.63 KiB | 6.70 MiB/s, done.
Resolving deltas: 100% (45/45), done.

In [2]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np

<h4>Here we will work with the Euclidean distance (normalized, it will be equivalent to the cosine distance). <br>
In the data cleaning part, we want to transform the <strong> City</strong> and <strong> Profession </strong> columns into numerical data, to be useful for the similarity measure, for this we need two datasets: <br>
<ul>
<li>A dataset of culturally similar cities (because people from same cultures tend to have similar tastes, behaviors...) </li>
<li>A dataset of similar occupations (we can transform the Profession column into categorical data (science, art, law), then into numerical data) </li>
</ul> </h4>

<h4>For the similarity measurement, two options are available: <br>
<ul>
<li>We can have a symmetric square matrix S of size n²=length(df)², indication the similarity between each two queries. <br>
But, calculating the S matrix will be computationally costly, at best complexity of O(n²) </li>
<li>Clustering  </li>
</h4>

<h4>For now, we will only work with the <strong>Age </strong> column, the rest of the work will remain the same since we should only change the formula for the Euclidean distance.
</h4>

<h2> S Matrix
</h2>

In [3]:
#the S matrix will contain distances of each query to the other queries
#then we normalize rows of the S matrix
#When people talk about generations, they're referring to all those born within roughly a 20-year period
#So we will set 20 as a threshold to similarity 

def S_Matrix (df, n): 
  #n: index of the column "Age"
  S=np.zeros(df.shape[0]**2).reshape(df.shape[0], df.shape[0])
  for i in range (df.shape[0]):
    S[i,i]=100  #The threshold is set to 20, So we will set values that we don't need (not similar) to 100>20, to not select them in the disered queries
    for j in range (i+1,df.shape[0]):
      if (df.iloc[i][n] != 'Null') and (df.iloc[j][n] != 'Null') :
        S[i,j]=abs(df.iloc[i][n] - df.iloc[j][n])
        S[j,i]=S[i,j]
      else :
        S[i,j]=100
        S[j,i]=100
  return (S)

In [43]:
from sklearn.preprocessing import normalize
#we will add a new column to df, "Similar_Queries"
#which will contain a matrix of the most similar queries to each query, and the similarity values
#These values will be normalized, and will be used as weights when calculating the missing ratings

def similar(S, df) :
  a=[]
  for i in range (S.shape[0]):
    b=[]
    for j in range (S.shape[0]):
      if S[i,j]<20 :
        b.append([j,S[i,j]])
    a.append(b)
  df['Similar_Queries']=a
  df['Similar_Queries']=df['Similar_Queries'].apply(lambda x: np.array(x).reshape(len(x),2), 1)
  for i in range (df.shape[0]):
    if (len(df['Similar_Queries'][i][:,1].reshape(-1, 1))!=0):
      df['Similar_Queries'][i][:,1]=normalize(df['Similar_Queries'][i][:,1].reshape(-1, 1), axis=0, norm='l1').reshape(1,-1)  #normalised Euclidean distance, but to use them as weights, we have to inverse them, so that nearest queries have the heighest weights
      df['Similar_Queries'][i][:,1]=normalize((np.ones(len(df['Similar_Queries'][i][:,1])) - df['Similar_Queries'][i][:,1]).reshape(-1, 1), axis=0, norm='l1').reshape(1,-1)  
  return (df)

In [11]:
#for a query that we want to rate, for a random user
#Similar queries that are not rated

<h4>

*   Transform the Queries definition into a table, similar to the query content table
*   Calculate similarity of each query to the others (if possible), this is content-based similarity (list of similar queries, as well as their weights)

</h4>

In [30]:
df2= pd.read_csv("/content/data_mining_2022/data/size_30/queries.csv")

In [31]:
df2['content']=df2['content'].apply(lambda x: x.strip().split('AND'))

def f1(x):
  for i in range (len(x)):
    x[i]=x[i].strip().split('=')
  return x 
df2['content']=df2['content'].apply(lambda x: f1(x) ,0 )

df2['content']=df2['content'].apply(lambda x: np.array(x).reshape(len(x),2), 0)

def f2(x,c):
  if c in x[:,0]:
    return (x[int((np.where(x==c))[0]),1])
  else :
    return('Null')
df2['Surname']=df2['content'].apply(lambda x: f2(x,'Surname'), 0)
df2['Name']=df2['content'].apply(lambda x: f2(x,'Name'), 0)
df2['City']=df2['content'].apply(lambda x: f2(x,'City'), 0)
df2['Profession']=df2['content'].apply(lambda x: f2(x,'Profession'), 0)
df2['Age']=df2['content'].apply(lambda x: f2(x,'Age'), 0)

df2['Age']=df2['Age'].apply(lambda x: int(x) if x!='Null' else x, 0)

df2=df2.set_index ('id')

In [44]:
S=S_Matrix (df2, 5)
df2=similar(S, df2)

In [45]:
df2 # !!!Queries id in Similar_Queries starts from index=0

,content,Surname,Name,City,Profession,Age,Similar_Queries
id,,,,,,,
query_01,"[[Profession, architect], [City, Rome], [Age, ...",Null,Ainsley,Rome,architect,38,"[[2.0, 0.15517241379310345], [13.0, 0.11206896..."
query_02,"[[Profession, pharmacist], [City, Moscow]]",Null,Null,Moscow,pharmacist,Null,[]
query_03,"[[Profession, advertising executive], [Age, 34]]",Null,Null,Null,advertising executive,34,"[[0.0, 0.15333333333333335], [13.0, 0.11666666..."
query_04,"[[Profession, financial analyst], [Age, 90]]",Null,Null,Null,financial analyst,90,"[[5.0, 0.39285714285714285], [7.0, 0.25], [12...."
query_05,"[[Profession, agricultural engineer], [Surname...",Johnson,Null,Null,agricultural engineer,Null,[]
query_06,"[[Profession, teacher], [Surname, Sanders], [A...",Sanders,Annie,Null,teacher,96,"[[3.0, 0.39285714285714285], [7.0, 0.357142857..."
query_07,"[[Profession, psychologist], [City, Dublin]]",Null,Null,Dublin,psychologist,Null,[]
query_08,"[[City, Odessa], [Surname, Hughes], [Age, 104]]",Hughes,Null,Odessa,Null,104,"[[3.0, 0.36363636363636365], [5.0, 0.636363636..."
query_09,"[[City, Tirana]]",Null,Null,Tirana,Null,Null,[]
query_10,"[[City, Toronto], [Age, 69]]",Null,Null,Toronto,Null,69,"[[12.0, 0.1333333333333333], [14.0, 0.86666666..."
query_11,"[[Profession, barber], [Name, Emily]]",Null,Emily,Null,barber,Null,[]
query_12,"[[City, Berlin], [Surname, Flores]]",Flores,Null,Berlin,Null,Null,[]
query_13,"[[Surname, Sullivan], [Age, 82]]",Sullivan,Null,Null,Null,82,"[[3.0, 0.27999999999999997], [5.0, 0.24], [9.0..."
query_14,"[[Profession, baker], [Surname, Long], [Age, 19]]",Long,Null,Null,baker,19,"[[0.0, 0.13026819923371646], [2.0, 0.137931034..."
query_15,"[[Profession, aerospace engineer], [Surname, H...",Henderson,Null,Null,aerospace engineer,67,"[[9.0, 0.8823529411764706], [12.0, 0.117647058..."
query_16,"[[Profession, therapist], [Surname, Foster]]",Foster,Null,Null,therapist,Null,[]
query_17,"[[Age, 29], [Name, Alexis]]",Null,Alexis,Null,Null,29,"[[0.0, 0.12474849094567404], [2.0, 0.132796780..."
query_18,"[[City, Plzen], [Surname, Gonzalez]]",Gonzalez,Null,Plzen,Null,Null,[]
query_19,"[[Profession, biomedical scientist], [Surname,...",Stewart,Delilah,Null,biomedical scientist,30,"[[0.0, 0.13999999999999999], [2.0, 0.153333333..."
query_20,"[[Profession, air traffic controller], [City, ...",Edwards,Null,Moscow,air traffic controller,Null,[]
query_21,"[[Profession, interior designer], [Surname, Gr...",Graham,Filippo,Null,interior designer,6,"[[13.0, 0.23529411764705888], [24.0, 0.7647058..."
query_22,"[[Surname, Rivera], [Age, 39], [Name, Liam]]",Rivera,Liam,Null,Null,39,"[[0.0, 0.19523809523809524], [2.0, 0.176190476..."
query_23,"[[Profession, meteorologist], [City, Stockholm]]",Null,Null,Stockholm,meteorologist,Null,[]
query_24,"[[Profession, pharmacist], [City, Odessa]]",Null,Null,Odessa,pharmacist,Null,[]
query_25,"[[Profession, athletic trainer], [Surname, Wat...",Watson,Dave,Null,athletic trainer,10,"[[13.0, 0.2745098039215686], [16.0, 0.20915032..."
query_26,"[[Profession, technologist], [City, Tokyo], [N...",Null,Filippo,Tokyo,technologist,Null,[]
query_27,"[[Age, 46]]",Null,Null,Null,Null,46,"[[0.0, 0.17922077922077922], [2.0, 0.168831168..."
query_28,"[[Profession, airline pilot], [City, Christchu...",Null,Null,Christchurch,airline pilot,29,"[[0.0, 0.12474849094567404], [2.0, 0.132796780..."
query_29,"[[Profession, civil engineer], [Surname, Morri...",Morris,Carson,Null,civil engineer,Null,[]
query_30,"[[City, Bologna], [Name, Ava]]",Null,Ava,Bologna,Null,Null,[]